<template>
  <div class="container">
    <div class="header">
      <div class="menu">
        <div class="button_before"><button v-on:click="open" ><img src="../assets/sozai_cman_jp_20200722022512.png" class="sansen"></button></div>
        <div class="box"><img src="../assets/icon.PNG" class="icon"></div>
        <div class="hidden" v-show="isopen">
          <button v-on:click="close" class="button_after"><img src="../assets/batsu.svg" class="batsu"></button>
          <div class="menu_details">
            <p><button v-on:click="close"><router-link to="/">▷HILLBOX inc. TOP</router-link></button></p>
            <p><button v-on:click="close"><router-link to="/company">▷会社概要</router-link></button></p>
            <p><button v-on:click="close"><router-link to="/">▷マーケティング・PR企画</router-link></button></p>
            <p><button v-on:click="close"><router-link to="/">▷デジタルマーケティング</router-link></button></p>
            <p><button v-on:click="close"><router-link to="/">▷アプリ/WEBサービス開発</router-link></button></p>
            <pre><button v-on:click="close"><a href="https://twistantwin.com/">    ▶TwistanWin</a></button></pre>
            <p><button v-on:click="close"><router-link to="/privacy">▷Privacy policy</router-link></button></p>
          </div>
        </div>
      </div>
    </div>
    
    <div class="contents">
      <div class="content">
       <section class="detail_privacy">
         <h1>Privacy policy</h1>
         <p>ヒルボックス株式会社（以下「当社」といいます。）は、当社が提供するSNSサービス「同舟共済　パンダの恩返し」および「TwistantWin」、ウェブサイト、API、アプリケーション、SMS、メール通知などの当社のサービス（以下「本サービス」といいます。）における利用者に関する情報（本サービスをご利用いただくお客様に関する情報を指し、（以下「ユーザー情報」といいます。））を以下の通り取り扱います。

1、当社は、ユーザー情報の保護実現のため、個人情報保護法及びその他関連する法令等を遵守し、個人情報を含むユーザー情報の適切な取扱い及び保護に努めます。

2、当社が取得する情報及びその取得方法
当社は、本サービスにおいて、以下に定めるとおり、個人情報（個人情報保護法第２条第１項により定義された「個人情報」をいい、以下同様とします。）を含むユーザー情報を取得します。

2－1、ユーザーにご提供いただく情報
(1)ユーザー情報：ユーザーの氏名、メールアドレス及び電話番号、その他当社が指定するユーザーに関する情報

2－2、本サービスのご利用時に当社が収集する情報
(1)端末情報
当社は、ユーザーが端末又は携帯端末上で本サービスを利用する場合、本サービスの維持及び改善、又は不正行為防止のため、ユーザーが使用する端末情報（端末を識別可能なID情報等）を収集することがあります。
(2)ログ情報、行動履歴及びサービス利用状況に関する情報
当社は、本サービスの維持及び改善、又は不正行為防止のため、本サービスの利用時に自動で生成、保存されるIPアドレス、ユーザーからのリクエスト日時、本サービス内での操作履歴の情報や、ユーザーのサービス利用状況に関する情報を収集することがあります。
(3)Cookie及び匿名ID
本サービスにおいて、「Cookie（クッキー）」と呼ばれる技術及びこれに類する技術を使用する場合があります。Cookieとは、ウェブサーバがユーザーのコンピュータを識別する業界標準の技術です。Cookieは、ユーザーのコンピュータを識別することはできますが、ユーザー個人を識別することはできません。なお、電子端末上の設定の変更によりCookieの機能を無効にすることはできますが、本サービスの全部又は一部が利用できなくなる場合があります。

3、個人情報の管理
当社は、ユーザーの個人情報への不正アクセス・紛失・破損・改ざん・漏洩などを防止するため、セキュリティシステムの維持・管理体制の整備等の必要な措置を講じ、安全対策を実施し個人情報の厳重な管理を行ないます。

4、個人情報の利用目的
4－1、当社は、本サービスの利用を通じて取得したユーザー情報を下記の目的に利用致します。本人の同意なく利用目的の範囲を超えて利用することはありません。
(1)本サービスの提供・維持・改善
(2)ユーザー等への通知・対応等
(3)当社が提供する全てのサービスの提供・維持・改善
(4)第三者提供（求人企業への提供）
(5)第三者提供（上記以外）(広告効果の分析や、提携サービスの提供のため)
4－2、当社は、前項の利用目的を、変更前の利用目的と関連性を有すると合理的に認められる範囲内において変更することがあり、変更した場合には、ユーザーに対し、通知又は本サービス上若しくは本サイト(URLが必要)での掲示その他分かりやすい方法により公表します。

5、個人情報の第三者提供
当社は、お客さまよりお預かりした個人情報を適切に管理し、次のいずれかに該当する場合を除き、個人情報を第三者に開示いたしません。
(1)お客さまの同意がある場合
(2)お客さまが希望されるサービスを行なうために当社が業務を委託する業者に対して開示する場合
(3)法令に基づき開示することが必要である場合
(4)4－1に定める利用目的に該当する場合
(5)人の生命、身体又は財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき
(6)公衆衛生の向上又は児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき
(7)国の機関若しくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
(8)合併、会社分割、事業譲渡その他の事由によりユーザーの個人情報を含む事業の承継がなされる場合
6、個人データの共同利用について
当社は、提携事業者その他第三者との間で、提携サービスの提供等に必要な範囲において、ユーザーから取得した個人情報を共同利用することがあります。
7、個人情報の安全対策
当社は、個人情報の正確性及び安全性確保のために、セキュリティに万全の対策を講じています。
8、個人データの開示、訂正等について
ユーザーが本人の個人情報の照会・修正・削除などをご希望される場合には、本人であることを確認の上、対応させていただきます。
9、免責事項
以下の場合は、第三者による個人情報の取得に関し、当社は一切の責任を負いません。
・本サービスに入力した情報により、期せずして本人が特定できてしまった場合
・本サービスからリンクされる外部サイトにおいて、ユーザーより個人情報が提供され、またそれが利用された場合
・ ユーザー本人以外がユーザー個人を識別できる情報を入手した場合
10、法令、規範の遵守と本ポリシーの変更について
当社は、保有する個人情報に関して適用される日本の法令、その他規範を遵守するとともに、本ポリシーの内容を適宜見直し、その改善に努めます。
11、お問い合せ
当社の個人情報の取扱に関するお問い合せは下記までご連絡ください。
ヒルボックス株式会社
〒153-0061 東京都目黒区中目黒 5-28-18-202
Mail: info@hillbox.net
</p>

       </section>
       </div>

    </div>  
    <div class="links">
      <router-link to="/" class="link_to_top"> ▷TOP</router-link>
      <router-link to="/company" class="link_to_company"> ▷HILLBOX inc.</router-link>
    </div>
    </div>
</template>

<script>
import Logo from "~/components/Logo.vue";

export default {
  components: {
    Logo,
  },
  data() {
    return {
      isopen: false,
    }
  },
  methods: {
    open: function(){
      this.isopen = true;
      console.log(this.isopen);
    },
    close: function(){
      this.isopen = false;
    }
  }
};


</script>

<style>
@import "../assets/design.css";
</style>


